app/views/users/show.haml

    .mb-4
      - @user.posts.each do |post|
        .mb-4
          .bg-gray-300.px-5.py-5.border-t.border-r.border-l.border-dotted.border-gray-600.rounded-t
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]