app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "This is another new post!!"], ["user_id", 1], ["created_at", "2020-03-07 22:51:01.181497"], ["updated_at", "2020-03-07 22:51:01.181497"]]
---
  def create
    @user = User.find(params[:user_id])
    @post = @user.posts.build(post_params)
    if @post.save